


salary = [23898, 5684.78, 84533.565, 766744, 7545.788, 777899.453, 557567, 56577]

print(round(sum(salary) / len(salary), 2), ' - средняя зарплата в компании')
print(round(max(salary), 2), ' - максимальная зарплата в компании')
print(round(min(salary), 2), ' - минимальная зарплата в компании')



name = ['Иван', 'Надежда', 'Петр', 'Дмитрий', 'Мария', 'Сергей', 'Игорь', 'Виктория']

zipped = dict(zip(name, salary))
print(zipped['Иван'], ' - зарплата Ивана')
print(zipped['Надежда'], ' - зарплата Надежды')



